tap "cloudfoundry/tap"
tap "dart-lang/dart"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "hhvm/hhvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
tap "superfly/tap"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# Open source suite of directory software
brew "openldap"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Programming language for highly scalable real-time systems
brew "erlang"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Extendable open-source CI server
brew "jenkins-lts"
# High performance, distributed memory object caching system
brew "memcached"
# GNOME XML library
brew "libxml2"
# Open source relational database management system
brew "mysql", restart_service: true
# General-purpose scripting language
brew "php@7.4"
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Rich and complete approach to parallelism in C++
brew "tbb"
# UNIX shell (command interpreter)
brew "zsh"
brew "cloudfoundry/tap/cf-cli@7"
# Vault
brew "hashicorp/tap/vault"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# JIT compiler and runtime for the Hack language
brew "hhvm/hhvm/hhvm-nightly"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stylesheet Preprocessor
brew "sass/sass/sass"
brew "superfly/tap/flyctl"
# GraphQL client
cask "altair-graphql-client"
# Web browser focusing on privacy
cask "brave-browser"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# Clipboard manager
cask "jumpcut"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
cask "sneek"
# Messaging app with a focus on speed and security
cask "telegram"
cask "twitch"
# Open-source code editor
cask "visual-studio-code"
# Open-source markdown editor
cask "zettlr"
